Revit 2026 API

# VectorAtPoint(IListXYZ) Constructor

---

Initializes a new instance of the VectorAtPoint class

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VectorAtPoint(
	IList<XYZ> vectors
)
```
```vb
Public Sub New (
	vectors As IList(Of XYZ)
)
```
```cpp
public:
VectorAtPoint(
	IList<XYZ^>^ vectors
)
```
```fsharp
new :
        vectors : IList<XYZ> -> VectorAtPoint
```

#### Parameters

vectors IListXYZ

#### Reference

VectorAtPoint Class

VectorAtPoint Overload

Autodesk.Revit.DB.Analysis Namespace